﻿﻿﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************

//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:        PlatformSetup.uni
//
// Description:	PlatformSetup string definitions 
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>
/=#
#include "VFR.uni"

#string STR_PTT_FORM                     #language eng "Platform Trust Technology"
#string STR_PTT_FORM_HELP                #language eng "Platform Trust Technology"

//---------------------------------------------------------------------------
// fTPM Configuration
//---------------------------------------------------------------------------
#string STR_TPM_CONFIGURATION_PROMPT        #language eng "TPM Configuration"

#string STR_FIRMWARE_TPM_PROMPT             #language eng "fTPM"
#string STR_FIRMWARE_TPM_HELP               #language eng "Enable/Disable fTPM"

//---------------------------------------------------------------------------
//TDE Configuration
//---------------------------------------------------------------------------
#string STR_TDT_CONFIGURATION_FORM        #language eng "Security Configuration "

#string STR_SEC_FILE_SYSTEM_INTEGRITY_VALUE_STRING      #language eng "TXE File System Integrity Value"
#string STR_SEC_FILE_SYSTEM_INTEGRITY_VALUE             #language eng ""

#string STR_SEC_TEMP_DISABLE_HELP                       #language eng "TXE Temporary Disable"
#string STR_SEC_TEMP_DISABLE_STRING                     #language eng "TXE Firmware Mode"
#string STR_SEC_TEMP_DISABLE_PROMPT                     #language eng "TXE Temporary Disable"

#string STR_SEC_LOCAL_FW_UPDATE_HELP                    #language eng "TXE Disable/Enable TXE Local Fw Update"
#string STR_SEC_LOCAL_FW_UPDATE_STRING                  #language eng "TXE Local Fw Update"
#string STR_SEC_LOCAL_FW_UPDATE_PROMPT                  #language eng "TXE Temporary Disable"

#string STR_SEC_HMRFPO_HELP                             #language eng "TXE HMRFPO Disable"
#string STR_SEC_HMRFPO_STRING                           #language eng "TXE HMRFPO "
#string STR_SEC_HMRFPO_PROMPT                           #language eng "TXE HMRFPO Disable"

#string STR_SEC_FLASH_UPDATE_PROMPT                    #language eng "TXE HMRFPO "
#string STR_SEC_FLASH_UPDATE_HELP                      #language eng ""

#string STR_SEC_FIRMWARE_UPDATE_PROMPT                 #language eng "TXE Firmware Update"
#string STR_SEC_FIRMWARE_UPDATE_HELP                   #language eng ""
#string STR_SEC_UNCONFIGURATION_PROMPT                 #language eng "TXE Unconfiguration Perform"
#string STR_SEC_UNCONFIGURATION_HELP                   #language eng "Revert TXE settings to factory defaults"
#string STR_PTT_SUBTITLE                                        #language eng "Platform Trust Technology"
#string STR_PTT_DISABLE_PROMPT                         #language eng "PTT Disable"
#string STR_PTT_DISABLE_HELP                           #language eng "Disable PTT "

#string STR_SEC_EOP_HELP                                #language eng "Send EOP Message Befor Enter OS"
#string STR_SEC_EOP_PROMPT                              #language eng "TXE EOP Message"

#string STR_SEC_SETTING_PROMPT                         #language eng "TXE"
#string STR_SEC_SETTING_HELP                           #language eng ""

#string STR_TPM_CONFIGURATION_PROMPT                   #language eng "TPM Configuration"

#string STR_TDT_CONFIGURATION_PROMPT        #language eng "Intel(R) Anti-Theft Technology Configuration"
#string STR_TDT_CONFIGURATION_PROMPT_HELP        #language eng "Intel(R) Anti-Theft Technology Configuration"

#string STR_TXE_CONFIGURATION_PROMPT        #language eng "Intel(R) TXE Configuration"


#string STR_ATAM_PROMPT             #language eng "Intel(R) AT"
#string STR_ATAM_HELP               #language eng "Enable/Disable BIOS AT Code from Runing"

#string STR_ATAM_PBA_PROMPT             #language eng "Intel(R) AT Platform PBA"
#string STR_ATAM_PBA_HELP               #language eng "Enable/Disable BIOS AT Code from Runing"

#string STR_TDT_SUSPEND_PROMPT                         #language eng "Intel(R) AT Suspend Mode"
#string STR_TDT_SUSPEND_HELP                           #language eng "Request that platform enter AT Suspend Mode - Only Available when AT Enrolled"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
